# Токен телеграм бота
TG_TOKEN = ""

# user_id администраторов (отправте /id боту, чтобы узнать свой )
ADMINS = [

    ]

# путь к изображению, прикрепляемому к стартовому сообщению
START_PHOTO_PATH = "start_photo.png"

# Путь для сохранения изображений
PHOTO_DIR_PATH = "photos/"

# Путь к tesseract.exe
TERSSERACT_PATH = "tesseract/tesseract.exe"


"""Шаблоны сообщений"""

# Приветственное сообщение (при вводе /start)
START_MSG = """Приветствую!
Для участия в акции введите /action"""

# Первое сообщение инструкции для участия в акции (при вводе /action)
ACTION_MSG = "Чтобы участвовать в акции, отправьте фотографию чека"

# Сообщение пользователю с просьбой подтвердить определенный автоматически номер чека ( {} - служебные символы, вместо них будет подставлен номер)
ACTION_NUMBER_DEFINED = """Система распознала номер чека: {} 
Это верно?"""

# Варианты ответа:
# Положительный
ACTION_GOOD_NUMBER = """Да"""

# Отрицательный
ACTION_BAD_NUMBER = """Нет"""

# Сообщение, если пользователь указал, что номер был опредален неправильно
ACTION_BAD_NUMBER_NEXT = """В таком случае введите номер:"""

# Сообщение, если номер не удалось распознать автоматически
ACTION_NUMBER_UNDEFINED = """Система не смогла распознать номер чека, введите его самостоятельно"""

#  Сообщение, если пользователь отправил сообщение не прикрепив фотографию чека
ACTION_NO_PHOTO_MSG = "Вы не прикрепили фотографию("

# Сообщение, если номер чека пользователя не прошел проверку на уникальность в бд
ACTION_USED_RECEIPT = "Похоже, ваш чек уже был использован("

# Второе сообщение инструкции для участия в акции
ACTION_INPUT_NUMBER_MSG = "Введите Ваш контактный номер или просто нажмите кнопку ниже"

# Надпись на кнопке отправки номера
ACTION_CONTACT_BUTTON_TEXT = "Отправить номер"

# Третье сообщение инструкции для участия в акции
ACTION_INPUT_NAME_MSG = "Введите Ваше имя и фамилию"

# Последнее сообщение инструкции для участия в акции
LAST_ACTION_MSG = "Отлично! Теперь дождитесь проверки Вашей заявки"

# Сообщение в случае удачной модерации
SUCC_MOD_MSG = "Регистрация успешна. Теперь Вы участвуете в розыгрыше, удачи!"

# Сообщение в случае неудачной модерации
UNSUCC_MOD_MSG = """Упс, что то пошло не так. Возможно, Ваш чек уже был использован или Вы ввели некорректные данные.
Попробуйте снова!"""


